Publ/Cursos/FundIngSoftware.html
<!doctype html>
<html lang="en">
<head>
<title>Fundamentos de ingeniería de software</title>
<!-- 2022-02-25 Fri 01:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Cómo funcionan los correos electrónicos</a></li>
<li><a href="#sec-2">2. Qué es un <code>system on a chip</code></a></li>
<li><a href="#sec-3">3. Qué son Bits y bytes</a></li>
<li><a href="#sec-4">4. Como funcionan los circuitos electrónicos</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Fundamentos de ingeniería de software</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cómo funcionan los correos electrónicos</h2>
<div class="outline-text-2" id="text-1">
<p>
En orden:
</p>
<ol class="org-ol">
<li>Señal del teclado al presionar enter.
</li>
<li>Tarjeta madre
</li>
<li>CPU
</li>
<li>Sistema operativo (Drivers)
</li>
<li>Navegador de internet (recibe el enter)
</li>
<li>Evento del Navegador (en javascript)
</li>
<li>Javascript va a encapsular todo en una API
<ol class="org-ol">
<li>Aplication Program Interface - una interfaz para computadoras.
</li>
<li>AJAX - Asyncronous JavaScript and XML.
<ul class="org-ul">
<li>Podemos enviar cualquier cosa que queramos a un servidor sin recargar la página.
</li>
<li>Ecapsulan JSON
</li>
</ul>
</li>
<li>JSON - JavaScript Object Notation
</li>
<li>REST - Representational State Transfer
<ul class="org-ul">
<li>El método de envio
</li>
</ul>
</li>
<li>HTTP - Hypertext transfer protocol
<ul class="org-ul">
<li>Protocolo de transferencia.
</li>
</ul>
</li>
</ol>
</li>
<li>URLs
<ol class="org-ol">
<li><code>https://gmail.com/evias_email</code>
</li>
<li>https - Llave de cifrado con el servidor, permite una conexión segura.
</li>
<li>gmail.com - Dominio
<ul class="org-ul">
<li>DNS - Domain Name Server
<ul class="org-ul">
<li>Una base de datos que liga una IP a un nombre de dominio.
</li>
</ul>
</li>
</ul>
</li>
<li><code>/envias_email</code> - La instrución al servidor.
</li>
</ol>
</li>
<li>Servidor - Corriendo en Linux
<ol class="org-ol">
<li>Ethernet
</li>
<li>TCP/IP
</li>
<li>HTTP
</li>
<li>Servidores web (ngix, apache)
</li>
<li>Lenguaje de programación (java)
</li>
</ol>
</li>
<li>Base de datos
<ol class="org-ol">
<li>MySql, Postgres, Oracle
</li>
</ol>
</li>
<li>Servidor de correo
<ul class="org-ul">
<li>Protocolos de correo
<ul class="org-ul">
<li>SMTP - Simple Mail Transfer Protocol
</li>
<li>POP3 - Post Office Protocol
</li>
</ul>
</li>
<li>Servidores de correo
<ul class="org-ul">
<li>PostFix
</li>
</ul>
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Qué es un <code>system on a chip</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>La combinación de los diferentes componentes que hacen una computadora
</li>
<li>Se compone de:
<ul class="org-ul">
<li>Bios: Arranca nuestro sistema.
</li>
<li>Ram: Se encarga de guardar rápidamente todos los datos a los que queremos acceder.
</li>
<li>CPU: Se encarga de procesar todo por dentro
</li>
<li>Chip de Radio: Controla las señales, wifi, bluetooh o celular.
</li>
<li>GPU: Se encarga de hacer la representación gráfica de nuestro sistema.
</li>
<li>Pelifericos: Es el medio entre nosotros y el sistema.
</li>
<li>Batería: Da energía al sistema y contiene su propio controlador.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Qué son Bits y bytes</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Todo viene de las ondas eléctricas.
</li>
<li>Descubrimos que podemos modularlas y usarlas para transmitir información
</li>
<li>Modulandolas podemos usarlas para representar 0s y 1s
<ul class="org-ul">
<li>Estos son los bits, las partes altas y bajas de las ondas.
</li>
</ul>
</li>
<li>IBM en los 50 definió el concepto de byte.
<ul class="org-ul">
<li>Un byte fue definido con 8 espacios (8 bits)
</li>
</ul>
</li>
<li>Bit: Unidad mínima de información 0s y 1s.
</li>
<li>Bytes: Compuestos por 8 Bits, cada uno tiene un valor posicional y corresponde a uno de los 8 primeros lugares
de una tabla de sistema binario.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Como funcionan los circuitos electrónicos</h2>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-02-25 Fri 01:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
